Tekla Open API Reference for Tekla Structures 2025
SettingsProxy.SetValue Method
 Sets a setting to a value.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetValue(
	string name,
	Object value
)
Public Sub SetValue (
	name As String,
	value As Object
)
Parameters
name
Type: System.String
The name of the setting.
value
Type: System.Object
The new value for the setting.
See Also
Reference
SettingsProxy Class
Tekla.Structures.Datatype Namespace